In [1]:

from mysql.connector import connect
import pandas as pd

In [2]:
conn = connect(
    host = '127.0.0.1',
    user= 'root',
    password='123456',
    database='humanresources',
    port = 3306    
)
conn.is_connected()

True

In [3]:
conn = connect(
    host = 'mysql.laptrinhpython.net',
    user= 'hv',
    password='123456',
    database='humanresources',
    port = 3306    
)
conn.is_connected()

True

In [4]:
cursor = conn.cursor()
sql = 'select * from employees limit 5 '
cursor.execute(sql)
for row in cursor:
    print(row)
cursor.close()

(100, 'Steven', 'King', 'SKING', '515.123.4567', '2003-06-17 00:00:00', 'AD_PRES', Decimal('24000.00'), None, None, 90)
(101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', '2005-09-21 00:00:00', 'AD_VP', Decimal('17000.00'), None, 100, 90)
(102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', '2001-01-13 00:00:00', 'AD_VP', Decimal('17000.00'), None, 100, 90)
(103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', '2006-01-03 00:00:00', 'IT_PROG', Decimal('9000.00'), None, 102, 60)
(104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', '2007-05-21 00:00:00', 'IT_PROG', Decimal('6000.00'), None, 103, 60)

True

fetchone()

In [5]:
cursor = conn.cursor()
sql = 'select * from employees limit 5 '
cursor.execute(sql)
row = cursor.fetchone()
while row:
    print(row)
    row = cursor.fetchone()
cursor.close()

(100, 'Steven', 'King', 'SKING', '515.123.4567', '2003-06-17 00:00:00', 'AD_PRES', Decimal('24000.00'), None, None, 90)
(101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', '2005-09-21 00:00:00', 'AD_VP', Decimal('17000.00'), None, 100, 90)
(102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', '2001-01-13 00:00:00', 'AD_VP', Decimal('17000.00'), None, 100, 90)
(103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', '2006-01-03 00:00:00', 'IT_PROG', Decimal('9000.00'), None, 102, 60)
(104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', '2007-05-21 00:00:00', 'IT_PROG', Decimal('6000.00'), None, 103, 60)

True

fetchmany([]) and fetchall()

In [6]:
cursor = conn.cursor()
sql = 'select * from employees '
cursor.execute(sql)
# row = cursor.fetchone()
# rows_1 = cursor.fetchmany(1)
# rows_2 = cursor.fetchmany(3)
rows_3 = cursor.fetchall()
# print(row)
# print(rows_1)
# print(rows_2)    
cursor.close()

True

Parameters

In [ ]:
from_salary = int(input('Từ: '))
to_salary = int(input('Đến: ')) 
limit_display = int(input('Số lượng bản ghi cần hiển thị: '))   
cursor = conn.cursor()
sql = 'select * from employees where salary between %s and %s limit %s'
data = [from_salary, to_salary, limit_display]
    
cursor.execute(sql, params=data)
row = cursor.fetchall()
print(len(row))
columns = cursor.column_names
print(columns)
cursor.close()

22
('EMPLOYEE_ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER', 'HIRE_DATE', 'JOB_ID', 'SALARY', 'COMMISSION_PCT', 'MANAGER_ID', 'DEPARTMENT_ID')

True

In [8]:
df = pd.DataFrame(data = row, columns = columns)
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000.00,None,102,60
1,109,Daniel,Faviet,DFAVIET,515.124.4169,2002-08-16 00:00:00,FI_ACCOUNT,9000.00,None,108,100
2,110,John,Chen,JCHEN,515.124.4269,2005-09-28 00:00:00,FI_ACCOUNT,8200.00,None,108,100
3,111,Ismael,Sciarra,ISCIARRA,515.124.4369,2005-09-30 00:00:00,FI_ACCOUNT,7700.00,None,108,100
4,112,Jose Manuel,Urman,JMURMAN,515.124.4469,2006-03-07 00:00:00,FI_ACCOUNT,7800.00,None,108,100

Cách 2

In [9]:
df2 = pd.read_sql(sql, conn, params=data)
df2.head()

C:\Users\RAZER\AppData\Local\Temp\ipykernel_33428\3719452057.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(sql, conn, params=data)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000.0,NaN,102,60
1,109,Daniel,Faviet,DFAVIET,515.124.4169,2002-08-16 00:00:00,FI_ACCOUNT,9000.0,NaN,108,100
2,110,John,Chen,JCHEN,515.124.4269,2005-09-28 00:00:00,FI_ACCOUNT,8200.0,NaN,108,100
3,111,Ismael,Sciarra,ISCIARRA,515.124.4369,2005-09-30 00:00:00,FI_ACCOUNT,7700.0,NaN,108,100
4,112,Jose Manuel,Urman,JMURMAN,515.124.4469,2006-03-07 00:00:00,FI_ACCOUNT,7800.0,NaN,108,100